In [1]:
import numpy as np
import pandas as pd

In [2]:
df = pd.DataFrame( {
    "id": [1001, 1002, 1003, 1004, 1005, 1006],
    "date": pd.date_range(20130102, periods=6),
    "city": ['beijing', 'SH', 'guangzhou', 'shenzhen', 'shagnhai', 'beijing'],
    "age": [23,44, 54, 32, 34, 32],
    "category":['100-A','100-B','110-A','110-C','210-A','130-F'],
    "price":[1200,np.nan,2133,5433,np.nan,4432]},
    columns =['id','date','city','category','age','price']
)

In [3]:
df

     id                          date       city category  age   price
0  1001 1970-01-01 00:00:00.020130102    beijing    100-A   23  1200.0
1  1002 1970-01-02 00:00:00.020130102         SH    100-B   44     NaN
2  1003 1970-01-03 00:00:00.020130102  guangzhou    110-A   54  2133.0
3  1004 1970-01-04 00:00:00.020130102   shenzhen    110-C   32  5433.0
4  1005 1970-01-05 00:00:00.020130102   shagnhai    210-A   34     NaN
5  1006 1970-01-06 00:00:00.020130102    beijing    130-F   32  4432.0

In [4]:
df.shape

(6, 6)

In [5]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 6 columns):
id          6 non-null int64
date        6 non-null datetime64[ns]
city        6 non-null object
category    6 non-null object
age         6 non-null int64
price       4 non-null float64
dtypes: datetime64[ns](1), float64(1), int64(2), object(2)
memory usage: 368.0+ bytes